# Multi-Indexing
- A multi_indexing or hierarchical index in pandas a way to create multiple index level for rows and columns in a Series or DataFrame
- It allows ua to work with multi-dimensional data in a tabular atructure

### types of multi-indexing
- pd.MultiIndex.from_tuples()
- pd.Multiindex.from_product()
- set_index() : setting multiple columns as index

In [2]:
import pandas as pd
import numpy as np

In [3]:
index_val =[('cse',2021),('cse',2022),('cse',2023),('cse',2024),('ece',2021),('ece',2022),('ece',2023),('ece',2024)]
a= pd.Series([1,2,3,4,5,6,7,8],index=index_val)
a

(cse, 2021)    1
(cse, 2022)    2
(cse, 2023)    3
(cse, 2024)    4
(ece, 2021)    5
(ece, 2022)    6
(ece, 2023)    7
(ece, 2024)    8
dtype: int64

In [5]:
a[('ece',2021)]

np.int64(5)

In [7]:
#a['ece']

# create multi index

In [10]:
# from tuples
multi_index=pd.MultiIndex.from_tuples(index_val)
multi_index

MultiIndex([('cse', 2021),
            ('cse', 2022),
            ('cse', 2023),
            ('cse', 2024),
            ('ece', 2021),
            ('ece', 2022),
            ('ece', 2023),
            ('ece', 2024)],
           )

In [12]:
series_data=pd.Series([1,2,3,4,5,6,7,8],index=multi_index)
series_data

cse  2021    1
     2022    2
     2023    3
     2024    4
ece  2021    5
     2022    6
     2023    7
     2024    8
dtype: int64

In [13]:
series_data['ece']

2021    5
2022    6
2023    7
2024    8
dtype: int64

In [17]:
# from product
pd.MultiIndex.from_product([['cse','ece'],[2021,2022,2023,2024]])

MultiIndex([('cse', 2021),
            ('cse', 2022),
            ('cse', 2023),
            ('cse', 2024),
            ('ece', 2021),
            ('ece', 2022),
            ('ece', 2023),
            ('ece', 2024)],
           )

In [19]:
multi_ind=pd.MultiIndex.from_product([['cse','ece'],[2021,2022,2023,2024]],names=['dept','year'])
multi_ind

MultiIndex([('cse', 2021),
            ('cse', 2022),
            ('cse', 2023),
            ('cse', 2024),
            ('ece', 2021),
            ('ece', 2022),
            ('ece', 2023),
            ('ece', 2024)],
           names=['dept', 'year'])

In [21]:
pd.DataFrame({
    'values':[1,2,3,4,5,6,7,8],
},index=multi_ind)

           values
dept year
cse  2021       1
     2022       2
     2023       3
     2024       4
ece  2021       5
     2022       6
     2023       7
     2024       8

In [22]:
multi_col=pd.MultiIndex.from_product([['Ktm','Pkr'],['avg_pack','students']])
multi_col

MultiIndex([('Ktm', 'avg_pack'),
            ('Ktm', 'students'),
            ('Pkr', 'avg_pack'),
            ('Pkr', 'students')],
           )

# use for both side of DF

In [26]:
placement= pd.DataFrame([
    ['20k',50,'25k',40],
    ['21k',45,'25k',42],
    ['25k',55,'30k',50],
    ['25k',50,'28k',48],
    ['20k',50,'25k',40],
    ['21k',45,'25k',42],
    ['25k',55,'30k',50],
    ['25k',50,'28k',48]
],index= multi_ind,columns=multi_col)
placement

               Ktm               Pkr
          avg_pack students avg_pack students
dept year
cse  2021      20k       50      25k       40
     2022      21k       45      25k       42
     2023      25k       55      30k       50
     2024      25k       50      28k       48
ece  2021      20k       50      25k       40
     2022      21k       45      25k       42
     2023      25k       55      30k       50
     2024      25k       50      28k       48

# .set_index()

In [28]:
import seaborn as sns

In [31]:
tips=sns.load_dataset('tips')
tips_subset=tips.set_index(['day','time'])
tips_subset

             total_bill   tip     sex smoker  size
day  time
Sun  Dinner       16.99  1.01  Female     No     2
     Dinner       10.34  1.66    Male     No     3
     Dinner       21.01  3.50    Male     No     3
     Dinner       23.68  3.31    Male     No     2
     Dinner       24.59  3.61  Female     No     4
...                 ...   ...     ...    ...   ...
Sat  Dinner       29.03  5.92    Male     No     3
     Dinner       27.18  2.00  Female    Yes     2
     Dinner       22.67  2.00    Male    Yes     2
     Dinner       17.82  1.75    Male     No     2
Thur Dinner       18.78  3.00  Female     No     2

[244 rows x 5 columns]

In [32]:
tips_subset.loc['Sat'].loc['Dinner']

        total_bill   tip     sex smoker  size
time
Dinner       20.65  3.35    Male     No     3
Dinner       17.92  4.08    Male     No     2
Dinner       20.29  2.75  Female     No     2
Dinner       15.77  2.23  Female     No     2
Dinner       39.42  7.58    Male     No     4
...            ...   ...     ...    ...   ...
Dinner       35.83  4.67  Female     No     3
Dinner       29.03  5.92    Male     No     3
Dinner       27.18  2.00  Female    Yes     2
Dinner       22.67  2.00    Male    Yes     2
Dinner       17.82  1.75    Male     No     2

[87 rows x 5 columns]

In [33]:
tips_subset.loc['Sat','Dinner']

C:\Users\ACER\AppData\Local\Temp\ipykernel_16024\2844967706.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  tips_subset.loc['Sat','Dinner']

            total_bill   tip     sex smoker  size
day time
Sat Dinner       20.65  3.35    Male     No     3
    Dinner       17.92  4.08    Male     No     2
    Dinner       20.29  2.75  Female     No     2
    Dinner       15.77  2.23  Female     No     2
    Dinner       39.42  7.58    Male     No     4
...                ...   ...     ...    ...   ...
    Dinner       35.83  4.67  Female     No     3
    Dinner       29.03  5.92    Male     No     3
    Dinner       27.18  2.00  Female    Yes     2
    Dinner       22.67  2.00    Male    Yes     2
    Dinner       17.82  1.75    Male     No     2

[87 rows x 5 columns]

In [35]:
tips_subset.xs('Sun')

        total_bill   tip     sex smoker  size
time
Dinner       16.99  1.01  Female     No     2
Dinner       10.34  1.66    Male     No     3
Dinner       21.01  3.50    Male     No     3
Dinner       23.68  3.31    Male     No     2
Dinner       24.59  3.61  Female     No     4
...            ...   ...     ...    ...   ...
Dinner       20.90  3.50  Female    Yes     3
Dinner       30.46  2.00    Male    Yes     5
Dinner       18.15  3.50  Female    Yes     3
Dinner       23.10  4.00    Male    Yes     3
Dinner       15.69  1.50    Male    Yes     2

[76 rows x 5 columns]

In [36]:
# rename index
tips_subset.index.names=['Day','Time']
tips_subset

             total_bill   tip     sex smoker  size
Day  Time
Sun  Dinner       16.99  1.01  Female     No     2
     Dinner       10.34  1.66    Male     No     3
     Dinner       21.01  3.50    Male     No     3
     Dinner       23.68  3.31    Male     No     2
     Dinner       24.59  3.61  Female     No     4
...                 ...   ...     ...    ...   ...
Sat  Dinner       29.03  5.92    Male     No     3
     Dinner       27.18  2.00  Female    Yes     2
     Dinner       22.67  2.00    Male    Yes     2
     Dinner       17.82  1.75    Male     No     2
Thur Dinner       18.78  3.00  Female     No     2

[244 rows x 5 columns]

In [37]:
tips_subset.swaplevel('Time','Day')

             total_bill   tip     sex smoker  size
Time   Day
Dinner Sun        16.99  1.01  Female     No     2
       Sun        10.34  1.66    Male     No     3
       Sun        21.01  3.50    Male     No     3
       Sun        23.68  3.31    Male     No     2
       Sun        24.59  3.61  Female     No     4
...                 ...   ...     ...    ...   ...
       Sat        29.03  5.92    Male     No     3
       Sat        27.18  2.00  Female    Yes     2
       Sat        22.67  2.00    Male    Yes     2
       Sat        17.82  1.75    Male     No     2
       Thur       18.78  3.00  Female     No     2

[244 rows x 5 columns]

# sorting

In [41]:
placement.sort_index(level='year').swaplevel('year','dept')

               Ktm               Pkr
          avg_pack students avg_pack students
year dept
2021 cse       20k       50      25k       40
     ece       20k       50      25k       40
2022 cse       21k       45      25k       42
     ece       21k       45      25k       42
2023 cse       25k       55      30k       50
     ece       25k       55      30k       50
2024 cse       25k       50      28k       48
     ece       25k       50      28k       48

In [43]:
placement.reset_index()

  dept  year      Ktm               Pkr
             avg_pack students avg_pack students
0  cse  2021      20k       50      25k       40
1  cse  2022      21k       45      25k       42
2  cse  2023      25k       55      30k       50
3  cse  2024      25k       50      28k       48
4  ece  2021      20k       50      25k       40
5  ece  2022      21k       45      25k       42
6  ece  2023      25k       55      30k       50
7  ece  2024      25k       50      28k       48

In [46]:
placement['Ktm','students'].groupby(level=['dept']).mean()

dept
cse    50.0
ece    50.0
Name: (Ktm, students), dtype: float64

# Reshaping
- to transform structire of DF to make it more suitable for analysis for analysis and visualization.
- it involves changing the layout of rows and columns without altering the underlying data.
- common reshaping technique:
    - pivot_tables : summarizing data with aggregation . long-format to wide format
    - melting : convert wide format data to long format
    - stacking?unstacking : moving index levels betweem rows and columns

In [47]:
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [50]:
deaths =pd.read_csv('time_series_covid19_confirmed_global.csv')
confirm= pd.read_csv('time_series_covid19_confirmed_global.csv')

In [51]:
deaths

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,12/24/22,12/25/22,12/26/22,12/27/22,12/28/22,12/29/22,12/30/22,12/31/22,1/1/23,1/2/23
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,207310,207399,207438,207460,207493,207511,207550,207559,207616,207627
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,333749,333749,333751,333751,333776,333776,333806,333806,333811,333812
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,271194,271198,271198,271202,271208,271217,271223,271228,271229,271229
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,47686,47686,47686,47686,47751,47751,47751,47751,47751,47751
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,104973,104973,104973,105095,105095,105095,105095,105095,105095,105095
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,703228,703228,703228,703228,703228,703228,703228,703228,703228,703228
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,535
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11945,11945,11945,11945,11945,11945,11945,11945,11945,11945
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,334021,334021,334066,334108,334196,334294,334425,334425,334629,334661
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,259981,259981,259981,259981,259981,259981,259981,259981,259981,259981

In [52]:
confirm

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,12/24/22,12/25/22,12/26/22,12/27/22,12/28/22,12/29/22,12/30/22,12/31/22,1/1/23,1/2/23
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,207310,207399,207438,207460,207493,207511,207550,207559,207616,207627
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,333749,333749,333751,333751,333776,333776,333806,333806,333811,333812
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,271194,271198,271198,271202,271208,271217,271223,271228,271229,271229
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,47686,47686,47686,47686,47751,47751,47751,47751,47751,47751
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,104973,104973,104973,105095,105095,105095,105095,105095,105095,105095
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,703228,703228,703228,703228,703228,703228,703228,703228,703228,703228
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,535
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11945,11945,11945,11945,11945,11945,11945,11945,11945,11945
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,334021,334021,334066,334108,334196,334294,334425,334425,334629,334661
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,259981,259981,259981,259981,259981,259981,259981,259981,259981,259981

In [55]:
print(deaths.shape)
print(confirm.shape)

(289, 1081)
(289, 1081)

In [56]:
deaths.columns

Index(['Province/State', 'Country/Region', 'Lat', 'Long', '1/22/20', '1/23/20',
       '1/24/20', '1/25/20', '1/26/20', '1/27/20',
       ...
       '12/24/22', '12/25/22', '12/26/22', '12/27/22', '12/28/22', '12/29/22',
       '12/30/22', '12/31/22', '1/1/23', '1/2/23'],
      dtype='object', length=1081)

In [60]:
deaths_new=deaths.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'],var_name='Date',value_name='Num_Deaths')
deaths_new

,Province/State,Country/Region,Lat,Long,Date,Num_Deaths
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
311248,NaN,West Bank and Gaza,31.952200,35.233200,1/2/23,703228
311249,NaN,Winter Olympics 2022,39.904200,116.407400,1/2/23,535
311250,NaN,Yemen,15.552727,48.516388,1/2/23,11945
311251,NaN,Zambia,-13.133897,27.849332,1/2/23,334661
311252,NaN,Zimbabwe,-19.015438,29.154857,1/2/23,259981

In [63]:
confirm_new=confirm.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'],var_name='Date',value_name='Num_confirm')
confirm_new

,Province/State,Country/Region,Lat,Long,Date,Num_confirm
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
311248,NaN,West Bank and Gaza,31.952200,35.233200,1/2/23,703228
311249,NaN,Winter Olympics 2022,39.904200,116.407400,1/2/23,535
311250,NaN,Yemen,15.552727,48.516388,1/2/23,11945
311251,NaN,Zambia,-13.133897,27.849332,1/2/23,334661
311252,NaN,Zimbabwe,-19.015438,29.154857,1/2/23,259981

In [70]:
deaths_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311253 entries, 0 to 311252
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Province/State  98007 non-null   object
 1   Country/Region  311253 non-null  object
 2   Lat             309099 non-null  float64
 3   Long            309099 non-null  float64
 4   Date            311253 non-null  object
 5   Num_Deaths      311253 non-null  int64
dtypes: float64(2), int64(1), object(3)
memory usage: 14.2+ MB

In [71]:
confirm_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311253 entries, 0 to 311252
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Province/State  98007 non-null   object
 1   Country/Region  311253 non-null  object
 2   Lat             309099 non-null  float64
 3   Long            309099 non-null  float64
 4   Date            311253 non-null  object
 5   Num_confirm     311253 non-null  int64
dtypes: float64(2), int64(1), object(3)
memory usage: 14.2+ MB

In [72]:
finale_new=confirm_new.merge(deaths_new,on=['Province/State', 'Country/Region', 'Lat', 'Long','Date'])
finale_new

,Province/State,Country/Region,Lat,Long,Date,Num_confirm,Num_Deaths
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0,0
...,...,...,...,...,...,...,...
311248,NaN,West Bank and Gaza,31.952200,35.233200,1/2/23,703228,703228
311249,NaN,Winter Olympics 2022,39.904200,116.407400,1/2/23,535,535
311250,NaN,Yemen,15.552727,48.516388,1/2/23,11945,11945
311251,NaN,Zambia,-13.133897,27.849332,1/2/23,334661,334661
311252,NaN,Zimbabwe,-19.015438,29.154857,1/2/23,259981,259981

In [73]:
finale_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311253 entries, 0 to 311252
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Province/State  98007 non-null   object
 1   Country/Region  311253 non-null  object
 2   Lat             309099 non-null  float64
 3   Long            309099 non-null  float64
 4   Date            311253 non-null  object
 5   Num_confirm     311253 non-null  int64
 6   Num_Deaths      311253 non-null  int64
dtypes: float64(2), int64(2), object(3)
memory usage: 16.6+ MB

In [74]:
  finale_new.to_csv('covid_2019.csv')

# stacking and unstacking

In [80]:
new=placement.stack(future_stack=True)
new

                    Ktm  Pkr
dept year
cse  2021 avg_pack  20k  25k
          students   50   40
     2022 avg_pack  21k  25k
          students   45   42
     2023 avg_pack  25k  30k
          students   55   50
     2024 avg_pack  25k  28k
          students   50   48
ece  2021 avg_pack  20k  25k
          students   50   40
     2022 avg_pack  21k  25k
          students   45   42
     2023 avg_pack  25k  30k
          students   55   50
     2024 avg_pack  25k  28k
          students   50   48

In [82]:
new.unstack()

               Ktm               Pkr
          avg_pack students avg_pack students
dept year
cse  2021      20k       50      25k       40
     2022      21k       45      25k       42
     2023      25k       55      30k       50
     2024      25k       50      28k       48
ece  2021      20k       50      25k       40
     2022      21k       45      25k       42
     2023      25k       55      30k       50
     2024      25k       50      28k       48

In [83]:
new.stack(future_stack=True)

dept  year
cse   2021  avg_pack  Ktm    20k
                      Pkr    25k
            students  Ktm     50
                      Pkr     40
      2022  avg_pack  Ktm    21k
                      Pkr    25k
            students  Ktm     45
                      Pkr     42
      2023  avg_pack  Ktm    25k
                      Pkr    30k
            students  Ktm     55
                      Pkr     50
      2024  avg_pack  Ktm    25k
                      Pkr    28k
            students  Ktm     50
                      Pkr     48
ece   2021  avg_pack  Ktm    20k
                      Pkr    25k
            students  Ktm     50
                      Pkr     40
      2022  avg_pack  Ktm    21k
                      Pkr    25k
            students  Ktm     45
                      Pkr     42
      2023  avg_pack  Ktm    25k
                      Pkr    30k
            students  Ktm     55
                      Pkr     50
      2024  avg_pack  Ktm    25k
                      Pkr    28k
            students  Ktm     50
                      Pkr     48
dtype: object

In [77]:
placement.unstack()

          Ktm                                             Pkr                 \
     avg_pack                students                avg_pack
year     2021 2022 2023 2024     2021 2022 2023 2024     2021 2022 2023 2024
dept
cse       20k  21k  25k  25k       50   45   55   50      25k  25k  30k  28k
ece       20k  21k  25k  25k       50   45   55   50      25k  25k  30k  28k


     students
year     2021 2022 2023 2024
dept
cse        40   42   50   48
ece        40   42   50   48

In [86]:
placement.unstack().unstack().unstack().unstack()

dept          cse                 ece
year         2021 2022 2023 2024 2021 2022 2023 2024
Ktm avg_pack  20k  21k  25k  25k  20k  21k  25k  25k
    students   50   45   55   50   50   45   55   50
Pkr avg_pack  25k  25k  30k  28k  25k  25k  30k  28k
    students   40   42   50   48   40   42   50   48

In [87]:
# stack() cannot use for series object

In [90]:
placement.unstack(level='dept')

          Ktm                        Pkr
     avg_pack      students     avg_pack      students
dept      cse  ece      cse ece      cse  ece      cse ece
year
2021      20k  20k       50  50      25k  25k       40  40
2022      21k  21k       45  45      25k  25k       42  42
2023      25k  25k       55  55      30k  30k       50  50
2024      25k  25k       50  50      28k  28k       48  48

In [92]:
# to convert rows into columns and vice-versa

placement.transpose()

dept          cse                 ece
year         2021 2022 2023 2024 2021 2022 2023 2024
Ktm avg_pack  20k  21k  25k  25k  20k  21k  25k  25k
    students   50   45   55   50   50   45   55   50
Pkr avg_pack  25k  25k  30k  28k  25k  25k  30k  28k
    students   40   42   50   48   40   42   50   48

In [95]:
 # pivot change long format to wide format